<?php

$data = [
    '0.255.255.255' => "保留地址\t保留地址\t\t",
    '9.255.255.255' => "美国\t美国\t\t",
    '10.255.255.255' => "局域网\t局域网\t\t",
    '100.63.255.255' => "美国\t美国\t\t",
    '100.127.255.255' => "共享地址\t共享地址\t\t",
    '126.255.255.255' => "日本\t日本\t\t",
    '127.0.0.0' => "局域网\t局域网\t\t",
    '127.0.0.1' => "本机地址\t本机地址\t\t",
    '127.255.255.255' => "局域网\t局域网\t\t",
    '169.253.255.255' => "美国\t美国\t\t",
    '169.254.255.255' => "本地链路\t本地链路\t\t",
    '172.15.255.255' => "美国\t美国\t\t",
    '172.31.255.255' => "局域网\t局域网\t\t",
    '191.255.255.255' => "巴西\t巴西\t\t",
    '192.0.0.255' => "保留地址\t保留地址\t\t",
    '192.0.1.255' => "美国\t美国\t\t",
    '192.0.2.255' => "保留地址\t保留地址\t\t",
    '192.12.108.255' => "美国\t美国\t\t",
    '192.12.109.255' => "保留地址\t保留地址\t\t",
    '192.12.115.255' => "巴西\t巴西\t\t",
    '192.12.116.255' => "保留地址\t保留地址\t\t",
    '192.12.117.255' => "摩洛哥\t摩洛哥\t\t",
    '192.12.118.255' => "保留地址\t保留地址\t\t",
    '192.52.192.255' => "美国\t美国\t\t",
    '192.52.193.255' => "保留地址\t保留地址\t\t",
    '192.67.22.255' => "美国\t美国\t\t",
    '192.67.23.255' => "保留地址\t保留地址\t\t",
    '192.75.136.255' => "美国\t美国\t\t",
    '192.75.137.255' => "保留地址\t保留地址\t\t",
    '192.75.235.255' => "加拿大\t加拿大\t\t",
    '192.75.236.255' => "保留地址\t保留地址\t\t",
    '192.88.98.255' => "德国\t德国\t\t",
    '192.88.99.255' => "保留地址\t保留地址\t\t",
    '192.94.76.255' => "德国\t德国\t\t",
    '192.94.78.255' => "保留地址\t保留地址\t\t",
    '192.147.10.255' => "美国\t美国\t\t",
    '192.147.11.255' => "保留地址\t保留地址\t\t",
    '192.156.201.255' => "美国\t美国\t\t",
    '192.156.202.255' => "保留地址\t保留地址\t\t",
    '192.167.255.255' => "意大利\t意大利\t\t",
    '192.168.255.255' => "局域网\t局域网\t\t",
    '192.197.112.255' => "加拿大\t加拿大\t\t",
    '192.197.113.255' => "保留地址\t保留地址\t\t",
    '192.231.237.255' => "非洲地区\t非洲地区\t\t",
    '192.231.238.255' => "保留地址\t保留地址\t\t",
    '198.17.78.255' => "美国\t美国\t\t",
    '198.17.79.255' => "保留地址\t保留地址\t\t",
    '198.17.255.255' => "美国\t美国\t\t",
    '198.19.255.255' => "保留地址\t保留地址\t\t",
    '198.51.99.255' => "亚太地区\t亚太地区\t\t",
    '198.51.100.255' => "保留地址\t保留地址\t\t",
    '199.212.56.255' => "美国\t美国\t\t",
    '199.212.57.255' => "保留地址\t保留地址\t\t",
    '202.96.133.255' => "中国\t广东\t珠海\t",
    '202.96.137.255' => "中国\t广东\t深圳\t",
    '202.103.23.255' => "中国\t湖北\t十堰\t",
    '202.103.45.255' => "中国\t湖北\t武汉\t",
    '203.0.112.255' => "澳大利亚\t澳大利亚\t\t",
    '203.0.113.255' => "保留地址\t保留地址\t\t",
    '204.48.31.255' => "美国\t美国\t\t",
    '204.48.33.255' => "保留地址\t保留地址\t\t",
    '204.52.190.255' => "美国\t美国\t\t",
    '204.52.191.255' => "保留地址\t保留地址\t\t",
    '204.225.41.255' => "加拿大\t加拿大\t\t",
    '204.225.43.255' => "保留地址\t保留地址\t\t",
    '205.211.82.255' => "加拿大\t加拿大\t\t",
    '205.211.83.255' => "保留地址\t保留地址\t\t",
    '223.255.255.255' => "澳大利亚\t澳大利亚\t\t",
    '255.255.254.255' => "保留地址\t保留地址\t\t",
    '255.255.255.255' => "IPIP.NET\t2018062912\t\t",
];

$items = [];
$string = '';
$_strings = [];
foreach ($data as $ip => $name) {
    if (!isset($_strings[$name])) {
        $_strings[$name] = [strlen($string), strlen($name)];
        $string .= $name;
    }
    $items[ip2long($ip)] = $_strings[$name];
}
unset($data);
unset($_strings);
$count = count($items);

foreach (['17monipdb.datx' => true, '17monipdb.dat' => false] as $path => $isDatX) {
    $path = __DIR__ . '/' . $path;
    if (file_exists($path)) {
        break;
    }

    $index = $isDatX ? 256 * 256 * 4 : 256 * 4;
    $step = $isDatX ? 256 * 256 : 256 * 256 * 256;
    $data = '';
    foreach ($items as $ip => $name) {
        $data .= pack('N', $ip);
        $data .= substr(pack('V', $name[0]), 0, 3);
        $data .= $isDatX ? pack('n', $name[1]) : pack('C', $name[1]);
    }

    $fp = fopen($path, 'wb');
    if (!is_resource($fp)) {
        die("{$path} fopen failed.\n");
    }
    fwrite($fp, pack('N', $index * 2 + strlen($data) + 4));

    $start = 0;
    $_items = array_keys($items);
    for ($ip = 0; $ip < 256 * 256 * 256 * 256; $ip += $step) {
        for (; $start < $count; $start++) {
            if ($ip <= $_items[$start]) {
                fwrite($fp, pack('V', $start));
                break;
            }
        }
    }

    fwrite($fp, $data);
    fwrite($fp, $string);
    fclose($fp);
}

return require_once(dirname(__DIR__) . '/vendor/autoload.php');
